Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/tribunals_and_investigations/commissions_of_investigation.html.txt.tmx
Source language: en
Languages: ga

source: The Commissions of Investigation Act 2004 provides for the establishment of commissions of investigation which can investigate matters of significant public concern
ga: Forálann an tAcht um Choimisiúin Imscrúdúcháin, 2004 do choimisiúin imscrúdaithe a bhunú ar féidir leo saincheisteanna a imscrúdú lena mbaineann saincheisteanna atá ina n-ábhar mór buartha poiblí

source: They are a less expensive and speedier method of investigating matters than a tribunal of inquiry
ga: Ní chosnaíonn siad an oiread céanna agus bealach níos tapúla iad chun saincheisteanna a imscrúdú ná binse fiosrúcháin

source: In certain circumstances, a tribunal of inquiry may be set up after a commission has reported
ga: Faoi roinnt cúinsí, féadtar binse fiosraithe a bhunú i ndiaidh gur thuairiscigh coimisiún

source: The Act provides that a commission is set up by government order – this must be approved by the Dail and Seanad
ga: Forálann an tAcht go mbunaíonn ordú rialtais coimisiún – ní mór don Dáil agus don Seanad é seo a fhaomhadh

source: The terms of reference are set by the Government or by an individual Minister
ga: Leagann an Rialtas nó Aire aonair na téarmaí tagartha amach

source: These terms must be accompanied by statements setting out the likely duration and cost of an investigation
ga: Ní mór go ngabhann ráitis leis na téarmaí seo ina leagtar amach fad agus costas dóchúil imscrúdaithe

source: Commissions of investigation that have been set up include:
ga: I measc na gcoimisiún imscrúdaithe a bunaíodh, tá:

source: • Commission of Investigation into Dublin and Monaghan Bombings (2005): Set up to investigate the 1974 bombings
ga: • Coimisiún Imscrúdaithe ar Bhuamáil Bhaile Átha Cliath agus Mhuineacháin (2005): a bunaíodh chun buamáil 1974 a imscrúdú

source: • Commission of Investigation into the Dublin Archdiocese (2006): Investigation into the handling of complaints of child sexual abuse involving Catholic priests in or attached to the Archdiocese of Dublin
ga: • Coimisiún Imscrúdaithe ar Ard-Deoise Bhaile Átha Cliath (2006): Imscrúdú ar ghearáin i leith drochúsáid ghnéasach leanaí a láimhseáil, ina raibh baint ag sagairt Chaitliceacha a bhain le hArd-Deoise Bhaile Átha Cliath

source: • Commission of Investigation into the Banking Sector in Ireland (2010): An investigation into the main causes of the banking crisis
ga: • Coimisiún Imscrúdaithe ar an Earnáil Bhaincéireachta in Éirinn (2010): Imscrúdú ar phríomhchúiseanna na géarchéime baincéireachta

source: Commissions are required to seek the voluntary co-operation of witnesses but have powers to compel people to give evidence if necessary
ga: Ceanglaítear ar choimisiúin comhoibriú deonach finnéithe a lorg ach tá cumhachtaí acu chun iallach a chur ar dhaoine fianaise a thabhairt más gá

source: They also have powers to search premises and take documents
ga: Chomh maith leis sin, tá an chumhacht acu chun áitreabh a chuardach agus cáipéisí a ghlacadh

source: In general, evidence is given in private
ga: Go ginearálta, tugtar fianaise go príobháideach

source: It is intended that commissions should be less adversarial than tribunals
ga: Tá sé beartaithe nár cheart go mbeadh gné sháraíochta chomh mór céanna i gceist le coimisiúin a bhíonn i gceist le binsí

source: The legal representatives of other parties will be present only if the commission is satisfied that their presence is necessary in the interests of the investigation and fair procedures
ga: Ní beidh ionadaithe dlí na bpáirtithe eile i láthair ach má tá an coimisiún sásta go dteastaíonn a láithreacht ar mhaithe leis an imscrúdú agus nósanna imeachta córa

source: Witnesses may only be cross-examined if the commission agrees
ga: Ní fhéadtar finné a chroscheistiú ach má chomhaontaíonn an coimisiún

source: The Act provides for guidelines to be prepared by the relevant Minister in respect of witnesses’ legal costs
ga: Forálann an tAcht do threoirlínte a réiteach ag an Aire ábhartha maidir le costais dlí na bhfinnéithe

source: A person who obstructs the commission or does not co-operate may be held liable for the additional costs resulting from this
ga: Féadtar duine a chuireann bac ar an gcoimisiún nó nach gcomhoibríonn a chur faoi dhliteanas íoc as costais bhreise a eascraíonn as seo

source: A commission makes a final report on its findings to a specified Minister
ga: Déanann coimisiún tuarascáil deiridh ar a dtorthaí le hAire sonraithe

source: The Minister may request interim reports on the general progress of a commission's investigation or on a particular aspect of the investigation
ga: Féadfaidh an tAire tuarascálacha eatramhacha a iarraidh ar dhul chun cinn ginearálta imscrúdú coimisiúin nó gné ar leith den imscrúdú

source: The Minister is obliged to publish the commission’s final report unless the Minister considers that such publication might prejudice any criminal proceedings that are in progress
ga: Tá dualgas ar an Aire tuarascáil deiridh an choimisiúin a fhoilsiú mura measann an tAire go bhféadfadh an foilsiú sin difear a dhéanamh d’aon imeachtaí coiriúla atá ar bun

source: In such a case, the Minister may apply to the High Court for directions
ga: Sa chás sin, féadfaidh an tAire iarratas a dhéanamh ar an Ard-Chúirt ar threoracha

source: There are provisions for people named in the report to challenge the findings in relation to them
ga: Tá forálacha ann do dhaoine atá ainmnithe sa tuarascáil chun cur i gcoinne na dtorthaí maidir leo
